; domain
(define (domain robot-domain)

(:requirements :strips)

(:predicates (robot ?r)(person ?p)(level ?level)(level_completed ?l)
             (wait_status ?r)(person_detected ?p)(person_ready ?p)
             (session_on ?r ?p)(all_levels_completed ?p)
)

(:action wait
    :parameters (?p)
    :precondition (and(person ?p)(not(person_detected ?p)))
    :effect (wait_status R)
)

(:action detect_person
    :parameters (?p)
    :precondition (and (person ?p)(not(person_detected ?p))(wait_status R))
    :effect (and(person_detected ?p)(not(wait_status R)))
)

(:action identify_person
    :parameters (?p)
    :precondition (and (person ?p)(person_detected ?p)(not(person_ready ?p)))
    :effect (and (person_ready ?p))
)

(:action start_session
    :parameters (?p)
    :precondition (and (person ?p)(person_ready ?p)(not (session_on R ?p)))
    :effect (session_on R ?p)
)

(:action run_level
    :parameters (?l)
    :precondition (and (level ?l)(not (level_completed ?l)))
    :effect (level_completed ?l)
)

(:action end_session
    :parameters (?p)
    :precondition (and (person ?p)(session_on R ?p)(not(all_levels_completed ?p))(level_completed L1)(level_completed L2))
    :effect (and (all_levels_completed ?p))
)

)

; problem
(define (problem robot-problem)

	(:domain robot-domain)

	(:objects R P L1 L2)

	(:init (robot R)(person P)
	       (level L1)(level L2))
	
	(:goal (and(not(wait_status R))(person_detected P)(person_ready P)(session_on R P)(all_levels_completed P)))
	
)

; plan
1. (wait p)
   added: (wait_status r)
   goals met: 0 of 5
2. (detect_person p)
   deleted: (wait_status r)
   added: (person_detected p)
   goals met: 2 of 5
3. (identify_person p)
   added: (person_ready p)
   goals met: 3 of 5
4. (start_session p)
   added: (session_on r p)
   goals met: 4 of 5
5. (run_level l1)
   added: (level_completed l1)
   goals met: 4 of 5
6. (run_level l2)
   added: (level_completed l2)
   goals met: 4 of 5
7. (end_session p)
   added: (all_levels_completed p)
   goals met: 5 of 5
